
"""
Табуляции и разрывы строк
В программировании термином "пропуск" (whitespace) называют такие нечитаемые символы, как пробелы, табуляции и символы
конца строки. Пропуски структурируют текст, чтобы пользователю было удобно читать его.
Для включения в текст позиции табуляции используется комбинация символов \t
"""

print('\tPython')

"""
Для разрыва строк применяют комбинацию символов '\n'
"""

print("Languages:\nPython\nC\nJavaScript")

# Если приминить совместно два спецсимвола, и \n, и \t - результат будет сильно отличаться

print("Languages:\n\tPython\n\tC\n\tJavaScript")
