
"""
Строки - это простая последовательность символов. Любая последовательность символов, заключённая в кавычки, в Python
считается строкой. При этом строки могут быть заключены как в одиночные (''), так и в двойные ("") кавычки.
"""

# Строка с использованием одинарных кавычек
'Строка с использованием одинарных кавычек'

# Строка с использованием двойных кавычек
"Строка с использованием двойных кавычек"

"""
Это правило позволяет использовать внутренние кавычки и апострофы в строках
"""

"The language 'Python' is named after Monty Python, not the snake."
'I told my friend, "Python is my favorite language!"'
