"""
Упражнение 4-7
Тройки.
Создать список чисел, кратных 3, в диапозоне от 3 до 30.
Вывести все числа в цикле for
"""

multiples = list(range(3, 31, 3))

for i in multiples:
    print(i)
