
"""
Упражнение 3-1

Имена: сохранить имена нескольких своих друзей в списке с именем names.
Вывести имя каждого друга, обратившись к каждому элементу списка (по одному за раз)
"""

names = ['николай', 'дмитрий', 'елена', 'сергей', 'валя']

# Вывод каждого элемента списка
print('Вывод каждого элемента списка')
print(names[0])
print(names[1])
print(names[2])
print(names[3])
print(names[4])
