
"""
Упражнение 3-4

Список гостей
Если бы можно было бы пригласить кого угодно (из живых или умерших) на обед, то кого бы пригласить?
Создать список, включающих минимум трёх людей, которых можно пригласить на обед.
Затем используя этот список для вывода пригласительного сообщения каждому участнику.
"""

my_friends = ['николай', 'елена', 'дмитрий', 'владимир', 'марина']
print(my_friends)

print("Приветстую тебя, " + my_friends[0].title() + ". Приглашаю тебя на обед.")
print("Приветстую тебя, " + my_friends[1].title() + ". Приглашаю тебя на обед.")
print("Приветстую тебя, " + my_friends[2].title() + ". Приглашаю тебя на обед.")
print("Приветстую тебя, " + my_friends[3].title() + ". Приглашаю тебя на обед.")
print("Приветстую тебя, " + my_friends[4].title() + ". Приглашаю тебя на обед.")
