
"""
Списки

Список - это набор элементов, следующих в определённом порядке. Можно создать список для хранения различных данных.
В список можно поместить любую информацию, причём данные в списке даже не обязаны быть как-то связаны друг с другом.
Так как список обычно содержит более одного элемента, рекомендуется присваивать спискам имена во множественном числе:
    letters,
    digits,
    names и т.д.
В Python список обозначается квадратными скобками ([ ]), а отдельные элементы списка разделяются запятыми.
"""

# Создание простого списка, список заключается в квадратных скобках.
bicycles = ['trek', 'cannondale', 'redline', 'specialized']

# Вывод всего списка на экран, как есть.
print(bicycles)
