
"""
Упражнение 2-5

Знаменитая цитата: найти известное высказывание, которое понравилось. Вывести текст цитаты с именем автора. Результат
должен выглядеть примерно так (включая кавычки):

Альберт Эйнштейн однажды сказал:

"Человек, который никогда не совершал ошибок, никогда не пробовал ничего нового".
"""

user_quote = ' однажды сказал: "Человек, который никогда не совершал ошибок, никогда не пробовал ничего нового."'
user_names = 'Альберт Эйнштейн'

print(user_names + user_quote)
print('\n', user_names + ' однажды сказал: "Человек, который никогда не совершал ошибок, никогда не пробовал ничего \
нового."')
