
"""
Упражнение 2-6

Знаменитая цитата: повторить упражнение 2-5, но на этот раз сохранить имя автора цитаты в переменной famous_person.
Затем составить сообщение и сохранить его в новой переменной с именем message. Вывести своё сообщение.
"""

famous_person = 'Альберт Эйнштейн'
message = ' однажды сказал: "Человек, который никогда не совершал ошибок, никогда не пробовал ничего нового."'

print('Выведем сообщение на экран при помощи конкатенации строк')
print('\n')
print(famous_person + message)
