
"""
Упражнение 2-3

Личное сообщение: сохранить имя пользователя в переменной и вывести сообщение, предназначенное для конкретного
человека. Сообщение должно быть простым, например: “Привет, Эрик, не хотел бы ты сегодня немного выучить Python?”
"""

user_names = 'eric'
print('Привет, ' + user_names + ', не хотел бы ты сегодня немного выучить Python?')

user_names = 'merin'
print('Привет, ' + user_names + ', не хотел бы ты сегодня немного выучить Python?')

user_names = 'bob'
print('Привет, ' + user_names + ', не хотел бы ты сегодня немного выучить Python?')

user_names = 'timur'
print('Привет, ' + user_names + ', не хотел бы ты сегодня немного выучить Python?')
