
"""
Упражнение 2-9

Любимое число: сохранить своё любимое число в переменной. Затем при помощи переменной создать сообщение для вывода
этого числа.
Вывести это сообщение.
"""

like_numbers = 3
message = 'Моё любимое число: '

print(message + str(like_numbers))
