
"""
Логические выражения.

В процессе программирования вы рано или поздно услышите термин "ЛОГИЧЕСКОЕ ВЫРАЖЕНИЕ".
По сути это всего лишь другое название для проверки условия. Результат логического выражения равен True или False, как
и результат условного выражения после его вычисления.
Логические выражения часто используются для проверки некоторых условий - например, запущена ли компьютерная игра или
разрешено ли пользователю редактирование некоторой информации на сайте:
"""

game_active = True
can_edit = False

"""
Логические выражения предоставляют эффективные средства для контроля состояния программы или определённого условия, 
играющего важную роль в вашей программе.
"""
